## Handling Missing Data

### Missing Data in Pandas

#### None: Pythonic missing data

In [1]:
import numpy as np
import pandas as pd

vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [2]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
103 ms ± 32.1 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
2.72 ms ± 896 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [3]:
# NumPy won't let you sum over an array containing None values
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### NaN: Missing numerical data

In [4]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [5]:
1 + np.nan

nan

In [6]:
0 * np.nan

nan

In [7]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [8]:
# Special aggregations for summing with NaN values
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

#### NaN and None in Pandas

In [9]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [10]:
# Pandas type-casts when NA values are present
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [11]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [12]:
x.sum()

1.0

### Operating on Null Values

In [14]:
# isnull()
# - Generates a Boolean mask indicating missing values
# notnull()
# - Opposite of isnull()
# dropna()
# - Returns a filtered version of the data
# fillna()
# - Returns a copy of the data with missing values filled or imputed

#### Detecting null values

In [15]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [16]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### Dropping null values

In [17]:
data.dropna()

0        1
2    hello
dtype: object

In [18]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2,    3,    5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [19]:
# Pandas can only drop full rows or columns
# Dropping rows
df.dropna()

     0    1  2
1  2.0  3.0  5

In [21]:
# Dropping columns
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [22]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [24]:
# Using how='all' drops only rows/columns containing all
# values as null
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [26]:
# Thresh allows you to specify a minimum number of 
# non-null values for the rows/columns to be kept

In [27]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

#### Filling null values

In [28]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [29]:
# Filling NA entries with a zero
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [31]:
# Propagating previous value forward
# ie. ffill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [32]:
# Propagating next values backward
# ie. bfill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [33]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [36]:
# ffill or bfill can also be used along a specific axis
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0